Тестовое_задание/src/Documents/НарядНаРаботу/НарядНаРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НарядНаРаботу</name>
  <basedOn>Document.ЗаявкаНаОбслуживание</basedOn>
  <attributes>
    <name>ЗаявкаОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОбслуживание</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыНарядовНаРаботу</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяСтоиомсть</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПереченьРабот</name>
    <attributes>
      <name>ВидРаботы</name>
      <type>
        <types>CatalogRef.ВидыРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовое_задание/src/Enums/СтатусыНарядовНаРаботу/СтатусыНарядовНаРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыНарядовНаРаботу</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

Тестовое_задание/src/Enums/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявок</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>Исполняется</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
</mdclass:Enum>

Тестовое_задание/src/Documents/НарядНаРаботу/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	Если Строка(Объект.Статус) = "Выполнен" или Строка(Объект.Статус) = "Отменен" Тогда
		Элементы.ЗаявкаОснование.ТолькоПросмотр = Истина;
		Элементы.Исполнитель.ТолькоПросмотр = Истина;
		Элементы.ПереченьРабот.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ЗаявкаОснование.ТолькоПросмотр = Ложь;
		Элементы.Исполнитель.ТолькоПросмотр = Ложь;
		Элементы.ПереченьРабот.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПереченьРаботСтоимостьПриИзменении(Элемент)
	Объект.ИтоговаяСтоиомсть = Объект.ПереченьРабот.Итог("Стоимость");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Строка(Объект.Статус) = "Выполнен" или Строка(Объект.Статус) = "Отменен" Тогда
		Элементы.ЗаявкаОснование.ТолькоПросмотр = Истина;
		Элементы.Исполнитель.ТолькоПросмотр = Истина;
		Элементы.ПереченьРабот.ТолькоПросмотр = Истина;
		Элементы.Статус.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ЗаявкаОснование.ТолькоПросмотр = Ложь;
		Элементы.Исполнитель.ТолькоПросмотр = Ложь;
		Элементы.ПереченьРабот.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НарядНаРаботу.Ссылка) КАК КоличествоНарядов
		|ИЗ
		|	Документ.НарядНаРаботу КАК НарядНаРаботу
		|ГДЕ
		|	НарядНаРаботу.ЗаявкаОснование = &ЗаявкаОснование";
	
	Запрос.УстановитьПараметр("ЗаявкаОснование", Объект.ЗаявкаОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	КоличествоНарядов = 0;
	КоличествоНарядов = ВыборкаДетальныеЗаписи.КоличествоНарядов;
	 	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НарядНаРаботу.Ссылка) КАК КоличествоНарядов
		|ИЗ
		|	Документ.НарядНаРаботу КАК НарядНаРаботу
		|ГДЕ
		|	НарядНаРаботу.ЗаявкаОснование = &ЗаявкаОснование
		|   И (НарядНаРаботу.Статус = &Статус
		|	ИЛИ НарядНаРаботу.Статус = &Статус1)";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыНарядовНаРаботу.Отменен);
	Запрос.УстановитьПараметр("Статус1", Перечисления.СтатусыНарядовНаРаботу.Выполнен);
	Запрос.УстановитьПараметр("ЗаявкаОснование", Объект.ЗаявкаОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();	
	
	КоличествоВыпОтмНаярдов = ВыборкаДетальныеЗаписи.КоличествоНарядов; 
	
	Если (КоличествоНарядов = КоличествоВыпОтмНаярдов+1) и (КоличествоНарядов<>0) И Объект.Статус<>Перечисления.СтатусыНарядовНаРаботу.Новый Тогда
		Заявка = Объект.ЗаявкаОснование.ПолучитьОбъект();
		Заявка.СтатусЗаявки = Перечисления.СтатусыЗаявок.Выполнена;
		Заявка.Записать();
	ИначеЕсли КоличествоНарядов = 0 Тогда 
		Заявка = Объект.ЗаявкаОснование.ПолучитьОбъект();
		Заявка.СтатусЗаявки = Перечисления.СтатусыЗаявок.Исполняется;
		Заявка.Записать();	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры
